export const surveyTemplate = {
  Set: [
    {
      formSet: 1,
      formLabel: "แบบสอบถามข้อมูลพื้นฐาน",
      questions: [
        {
          id: "q1",
          type: "select",
          maxAnswer: "1",
          label: "เพศของท่าน",
          options: [
            "ชาย",
            "หญิง",
            "อื่น ๆ"]
        },
        {
          id: "q2",
          type: "select",
          maxAnswer : "1",
          label: "อายุของท่าน",
          options: [
            "น้อยกว่า 29 ปี",
            "29-44 ปี",
            "45-60 ปี",
            "61 ปีขึ้นไป"]
        },
        {
          id: "q3",
          type: "select",
          maxAnswer : "1",
          label: "อาชีพของท่าน",
          options: [
            "ข้าราชการ",
            "เจ้าหน้าที่ของรัฐ/รัฐวิสาหกิจ",
            "พนักงานออฟฟิศ",
            "พนักงานโรงงาน",
            "ผู้ประกอบการ/ธุรกิจส่วนตัว",
            "ค้าขาย",
            "รับจ้างทั่วไป",
            "อาชีพด้านการเกษตร",
            "แม่บ้าน/พ่อบ้าน",
            "นักเรียน/นักศึกษา",
            "ฟรีแลนซ์/งานอิสระ",
            "ว่างงาน"
          ]
        },
        {
          id: "q4",
          type: "select",
          maxAnswer : "1",
          label: "รายได้เฉลี่ยต่อเดือน",
          options: [
            "ไม่เกิน 15,000 บาท",
            "15,001 - 25,000 บาท",
            "25,001 - 35,000 บาท",
            "35,001 - 45,000 บาท",
            "45,001 - 55,000 บาท",
            "มากกว่า 55,000 บาท",
          ]
        },
        {
          id: "q5",
          type: "select",
          maxAnswer : "6",
          label: "ช่วงอายุของบุตรท่าน (หากมีบุตรหลายช่วงอายุตอบได้มากกว่า 1 ข้อ)",
          options: [
            "ไม่มีบุตร",
            "0-5 ปี",
            "6-12 ปี",
            "13-15 ปี",
            "15-18 ปี",
            "18 ปีขึ้นไป",
          ]
        },
      ]
    },
    {
      formSet: 2,
      formLabel: "แบบสอบถามความพึงพอใจในการใช้งานและการปรับพฤติกรรม",
      questions: [
        {
          id: "q6",
          type: "rating",
          label: "ท่านพึงพอใจกับการใช้งานเครื่องมือในครั้งนี้มากน้อยเพียงใด",
          maxAnswer : "1",
        },
        {
          id: "q7",
          type: "rating",
          label: "ท่านตั้งใจว่าจะแนะนำแพลตฟอร์มนี้ให้เพื่อนหรือคนรู้จักของท่านได้ใช้งาน",
          maxAnswer : "1",
        }
      ]
    },
    {
      formSet: 3,
      formLabel : "แบบสอบถามพฤติกรรมการหลังการใช้งาน",
      questions: [
        {
          id: "q8",
          type: "rating",
          maxAnswer : "1",
          label: "ฉันได้นำข้อความจากเครื่องมือนี้ไปปรับใช้ในการสื่อสารจริงบนโลกออนไลน์",
        },
        {
          id: "q9",
          type: "rating",
          maxAnswer : "1",
          label: "ฉันได้รับประโยชน์จากการใช้งานแพลตฟอร์มนี้เพื่อสื่อสารอย่างสร้างสรรค์",
        },
        {
          id: "q10",
          type: "rating",
          maxAnswer : "1",
          label: "หลังจากที่ฉันได้ลองใช้เครื่องมือนี้ ฉันรู้สึกว่า การสื่อสารของฉันดีขึ้น และส่งผลเชิงบวกต่อผู้อื่นมากขึ้น",
        },
        {
          id: "q11",
          type: "rating",
          maxAnswer : "1",
          label: "ถ้าฉันอยากสื่อสารเชิงบวกบนโลกออนไลน์ ฉันอยากเข้ามาใช้เครื่องมือนี้เพื่อช่วยให้สื่อสารได้ดีขึ้น",
        }
      ]
    }
  ]
};