// data/surveyTemplate.js
export const surveyTemplate = {
  pages: [
    {
      pageId: 1,
      questions: [
        {
          id: "q1",
          type: "select",
          label: "เพศของท่าน",
          options: [
            "ชาย",
            "หญิง",
            "อื่น ๆ"]
        },
        {
          id: "q2",
          type: "select",
          label: "เพศของท่าน",
          options: [
            "น้อยกว่า 29 ปี",
            "29-44 ปี",
            "45-60 ปี",
            "61 ปีขึ้นไป"]
        },
        {
          id: "q3",
          type: "select",
          label: "อาชีพของท่าน",
          options: [
            "ข้าราชการ",
            "เจ้าหน้าที่ของรัฐ/รัฐวิสาหกิจ",
            "พนักงานออฟฟิศ",
            "พนักงานโรงงาน",
            "ผู้ประกอบการ / ธุรกิจส่วนตัว",
            "ค้าขาย",
            "รับจ้างทั่วไป",
            "อาชีพด้านการเกษตร",
            "แม่บ้าน/พ่อบ้าน",
            "นักเรียน/นักศึกษา",
            "ฟรีแลนซ์/งานอิสระ",
            "ว่างงาน"
          ]
        },
        {
          id: "q3",
          type: "select",
          label: "รายได้เฉลี่ยต่อเดือน",
          options: [
            "ไม่เกิน 15,000 บาท",
            "15,001 - 25,000 บาท",
            "25,001 - 35,000 บาท",
            "35,001 - 45,000 บาท",
            "45,001 - 55,000 บาท",
            "มากกว่า 55,000 บาท",
          ]
        },
       
      ]
    },
    {
      pageId: 2,
      questions: [
        {
          id: "q4",
          type: "select",
          label: "สิ่งที่ควรปรับปรุง",
          options: ["UI", "Performance", "Feature", "Support"]
        }
      ]
    }
  ]
};
